nordic-auko/nRF5-ble-timesync-demo/nRF5_SDK_16.0.0_98a08e2/examples/common/time_sync.c
    if (m_params.high_freq_timer[0] == NRF_TIMER3 || m_params.high_freq_timer[0] == NRF_TIMER4)
    {
        // TIMERS 0,1, and 2 only have 4 compare registers
        m_params.high_freq_timer[0]->CC[4]   = TIME_SYNC_TIMER_MAX_VAL / 2; // Only used for debugging purposes such as pin toggling
    }

    m_params.high_freq_timer[0]->SHORTS      = TIMER_SHORTS_COMPARE0_CLEAR_Msk;
    m_params.high_freq_timer[0]->TASKS_START = 1;
}

#if TIME_SYNC_TX_OFFSET_REALIGN_TIMEOUT == 0
static uint32_t calculate_tx_start_offset(void)
{
    return 0;
}
#else
static int32_t calculate_tx_start_offset(void)
{
    // It is best to align transmissions with the timer wraparound.
    // Calculate offset that can be added to the first TX packet in a series.
    // Due to between HFCLK and LFCLK this might have to be recalculated regularly.

    uint64_t ticks_now;
    uint64_t rounded_ticks;
    int32_t offset_us;

    ticks_now = ts_timestamp_get_ticks_u64();
    rounded_ticks = ((ticks_now + TIME_SYNC_TIMER_MAX_VAL) / TIME_SYNC_TIMER_MAX_VAL) * TIME_SYNC_TIMER_MAX_VAL;
    offset_us = ROUNDED_DIV(TIME_SYNC_TIMER_MAX_VAL, 16)  - (ROUNDED_DIV(rounded_ticks, 16) - ROUNDED_DIV(ticks_now, 16));

    NRF_LOG_DEBUG("offset_us: %d", offset_us);

    return offset_us;
}
#endif

uint32_t ts_set_trigger(uint32_t target_tick, uint32_t ppi_endpoint)
{
    if (!m_timeslot_session_open)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (ppi_sync_trigger_configure(ppi_endpoint) != NRF_SUCCESS)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    m_trigger_evt.params.triggered.sync_packet_count = 0;
    m_trigger_evt.params.triggered.used_packet_count = 0;

    // TODO: is there a way to check if the target value is plausible?
    m_trigger_evt.params.triggered.tick_start = ts_timestamp_get_ticks_u64() / TIME_SYNC_TIMER_MAX_VAL;

    // set capture to new target: (target - local_counter) + (local_counter - m_master_counter)
    m_params.high_freq_timer[1]->CC[4] = target_tick - m_master_counter;
    m_trigger_evt.params.triggered.tick_target = target_tick;
    nrf_ppi_channel_enable(m_params.ppi_chns[4]); // activate trigger
    return NRF_SUCCESS;
}

void SWI3_EGU3_IRQHandler(void)
{
    if (NRF_EGU3->EVENTS_TRIGGERED[0] != 0)
    {
        NRF_EGU3->EVENTS_TRIGGERED[0] = 0;

        nrf_atomic_u32_fetch_store(&m_master_counter, ((sync_pkt_t *) mp_curr_adj_pkt)->counter_val);
        m_params.high_freq_timer[1]->CC[4] = m_trigger_evt.params.triggered.tick_target - m_master_counter;	// calculate new capture

        m_trigger_evt.params.triggered.used_packet_count++;
        m_trigger_evt.params.triggered.last_sync = m_master_counter;

        nrf_atomic_flag_clear(&m_timer_update_in_progress);

        if (!m_synchronized)
        {
            m_synchronized = true;

            if (m_callback)
            {
                ts_evt_t evt =
                {
                    .type = TS_EVT_SYNCHRONIZED,
                };

                m_callback(&evt);
            }
        }
    }

    if (NRF_EGU3->EVENTS_TRIGGERED[2] != 0)
    {
        NRF_EGU3->EVENTS_TRIGGERED[2] = 0;
        nrf_ppi_channel_disable(m_params.ppi_chns[4]);

        if (m_callback)
        {
            m_callback(&m_trigger_evt);
        }
    }

    if (NRF_EGU3->EVENTS_TRIGGERED[3] != 0)
    {
        NRF_EGU3->EVENTS_TRIGGERED[3] = 0;

        if (m_synchronized)
        {
            m_synchronized = false;

            if (m_callback)
            {
                ts_evt_t evt =
                {
                    .type = TS_EVT_DESYNCHRONIZED,
                };

                m_callback(&evt);
            }
        }
    }

    if (NRF_EGU3->EVENTS_TRIGGERED[4] != 0)
    {
        int32_t offset_us;

        NRF_EGU3->EVENTS_TRIGGERED[4] = 0;

        offset_us = calculate_tx_start_offset();

        m_tx_offset = offset_us;
    }
}

static inline bool sync_timer_offset_compensate(sync_pkt_t * p_pkt)
{
    uint32_t peer_timer;
    uint32_t local_timer;
    uint32_t timer_offset;

    if (m_timer_update_in_progress)
    {
        return false;
    }

    if (CHECK_INVALID_TIMING(p_pkt->timer_val))
    {
        return false;
    }

    peer_timer  = p_pkt->timer_val;
    peer_timer += TX_CHAIN_DELAY;
    local_timer = m_params.high_freq_timer[0]->CC[1];

    if (local_timer > peer_timer)
    {
        timer_offset = TIME_SYNC_TIMER_MAX_VAL - local_timer + peer_timer;
    }
    else
    {
        timer_offset = peer_timer - local_timer;
    }

    /*
     * FIXME:
     * This is a PPI / timer timing issue:
     * If the the CC[2] for the timer reset is too close to the timer overflow,
     * the timer behavior becomes fuzzy...
     * Probably because of the PPI + timer task delays, it is possible that the
     * timestamp PPI task is executed after the timer was reset.
     */
    if (timer_offset < 5)
    {
        m_trigger_evt.params.triggered.used_packet_count++;
        m_trigger_evt.params.triggered.last_sync = p_pkt->counter_val;
        return false;
    }

    if (timer_offset == 0 || timer_offset == TIME_SYNC_TIMER_MAX_VAL)
    {
        // Already in sync
        m_trigger_evt.params.triggered.used_packet_count++;
        m_trigger_evt.params.triggered.last_sync = p_pkt->counter_val;
        return false;
    }
    else if (timer_offset > TIME_SYNC_TIMER_MAX_VAL)
    {
        m_params.high_freq_timer[0]->CC[2] = (timer_offset - TIME_SYNC_TIMER_MAX_VAL);
    }
    else
    {
        m_params.high_freq_timer[0]->CC[2] = (TIME_SYNC_TIMER_MAX_VAL - timer_offset);
    }

    /*
     * This is necessary, because the following timer reset will not be counted as step
     */
    p_pkt->counter_val++;

    // resetting the timer to the trigger target will skip the trigger -> avoid this
    if (p_pkt->counter_val == m_trigger_evt.params.triggered.tick_target)
    {
        return false;
    }

    ASSERT(m_params.high_freq_timer[0]->CC[2] < TIME_SYNC_TIMER_MAX_VAL);

    nrf_atomic_flag_set(&m_timer_update_in_progress);
    nrf_atomic_u32_fetch_store(&mp_curr_adj_pkt, (uint32_t) p_pkt);

